{"version":"https://jsonfeed.org/version/1","home_page_url":"http://localhost:3000/","feed_url":"http://localhost:3000/feed.json","items":[{"id":"http://localhost:3000/articles/recuperei-o-meu-blog-antigo!/","url":"http://localhost:3000/articles/recuperei-o-meu-blog-antigo!/","title":"Recuperei o meu blog antigo!","content_html":"<h1>Eu simplesmente não acredito nisso!</h1>\n<p>Longos foram os tempos que eu tive este blog, ô nostalgia!</p>\n<p>Este blog surgiu na época em que eu ainda não trabalhava, e durou até +/- o meu 2º mês de serviço. Desde então, eu fiz tantas mudanças e tantas reviravoltas que simplesmente eu achava que essa versão do site tinha virado uma história que só estava presente na minha cabeça e na de mais 3 pessoas:</p>\n<ul>\n<li>Um primo meu</li>\n<li>Um amigo meu</li>\n<li>A minha namorada</li>\n</ul>\n<p>Mas, essa parte de ter durado até +/- o meu 2º mês de trabalho foi o que salvou esse carinha, porquê o símeo que está escrevendo aqui, achou na época uma ótima ideia de fazer um backup no computador do trabalho ._.</p>\n<p>Mentira, não era backup coisa nenhuma, eu provavelmente estava desenvolvendo a versão feita usando Emacs desse site. Pois é, até isso eu usei. Ainda está no ar (por enquanto), o link é esse <a href=\"https://tukain.codeberg.page/\">aqui</a>.</p>\n<h1>A maior diferença dele</h1>\n<p>Esse site usa um <a href=\"https://en.wikipedia.org/wiki/Static_site_generator\">SSG</a> diferente da versão então mais recente, que usa <a href=\"https://jekyllrb.com/\">Jekyll</a>, ele usa o <a href=\"https://lume.land/\">Lume</a>!</p>\n<p>O Lume é um SSG feito pelo pessoal do [Deno.land], um runtime Javascript/Typescript, e que em si, é feito usando Typescript. E olha, o bichinho é rápido viu.</p>\n<p>Além disso, o Lume usa uma <a href=\"https://en.wikipedia.org/wiki/Template_processor\">templating engine</a> diferente do Jekyll também, ele usa o <a href=\"https://vento.js.org/\">Vento.js</a> no lugar do <a href=\"https://shopify.github.io/liquid/\">Liquid</a>. As diferenças são mais práticas do que parecem na realidade.</p>\n<p>A Liquid é apenas uma templating engine, com parâmetros pré-definidos, enquanto o Vento.js te permite usar JAVASCRIPT para fazer ações customizadas/processar o conteúdo, ou seja, você pode fazer qualquer coisa praticamente.</p>\n<h1>MUITOS PLUGINS ÚTEIS</h1>\n<p>A minha configuração atual é a seguinte:</p>\n<pre><code class=\"language-js\">import lume from &quot;lume/mod.ts&quot;;\nimport feed from &quot;lume/plugins/feed.ts&quot;;\nimport lightningCss from &quot;lume/plugins/lightningcss.ts&quot;;\nimport minifyHTML from &quot;lume/plugins/minify_html.ts&quot;;\nimport pagefind from &quot;lume/plugins/pagefind.ts&quot;;\n\nconst site = lume({\n  src: &quot;./src&quot;,\n  dest: &quot;./out&quot;,\n  server: {\n    open: false,\n  }\n});\n\n\nsite.ignore(&quot;README.md&quot;, &quot;.git&quot;, &quot;.gitignore&quot;);\n\nsite.script(&quot;update&quot;, &quot;git add . &amp;&amp; git commit -m 'Update' &amp;&amp; git push&quot;);\n\nsite.copy([&quot;.woff2&quot;, &quot;.png&quot;, &quot;.webp&quot;, &quot;.jpg&quot;, &quot;.ico&quot;, &quot;.gif&quot;]);\n\nsite.loadAssets([&quot;.js&quot;, &quot;.json&quot;])\n\nsite.use(pagefind())\n\nsite.use(minifyHTML())\n\nsite.use(lightningCss({ includes: &quot;assets/css/&quot; }))\n\nsite.use(feed({\n  output: [&quot;/feed.xml&quot;, &quot;/feed.json&quot;],\n  query: &quot;type=post&quot;,\n  info: {\n    title: &quot;=site.title&quot;,\n    description: &quot;=site.description&quot;,\n  },\n  items: {\n    title: &quot;=title&quot;,\n    description: &quot;=excerpt&quot;,\n  },\n}));\n\nexport default site;\n\n</code></pre>\n<p>Os plugins em si são:</p>\n<ul>\n<li>o creador de feeds rss e json</li>\n<li>o minificador de HTML</li>\n<li>o minificador de CSS</li>\n<li>a search engine do site</li>\n</ul>\n<p>Todos eles sendo bem simples de instalar, bastando apenas um <code>import</code> e pronto! Sem a necessidade de usar um arquivo separado para listar os plugins que deseja, configurar esses plugins no arquivo de configuração do site e depois rodar um comando que não é o comando que você usa para <strong>GERAR</strong> o site... te soa familiar, Jekyll?</p>\n<pre><code class=\"language-sh\">Gemfile -&gt; _config.yml -&gt; bundle\n</code></pre>\n<h1>LumeCMS</h1>\n<p>E claro, a cereja no bolo, esse carinha tem um freaking <a href=\"https://pt.wikipedia.org/wiki/Sistema_de_gerenciamento_de_conte%C3%BAdo\">CMS</a>! Que inclusive, é bem simples de se configurar e de utilizar.</p>\n<p>Ele basicamente facilita na criação de conteúdo, dando menus, botões e listas que você preenche com as informações da postagem e, claro, escreve o conteúdo em si.</p>\n<p>Ele também é configurado da mesma maneira que o site em si, só que em um arquivo diferente, o <code>_cms.js</code> (ou <code>_cms.ts</code>, caso você esteja usando Typescript).</p>\n<h1>Vou fazer algumas mudanças ainda</h1>\n<p>O que eu planejo fazer é uma espécie de combinação entre esse site e o anterior, feito com Jekyll.</p>\n<p>E uma das coisas que esse carinha precisa, é de um belo carinho do meu CSS atual.</p>\n<p>Outra coisa que vou ter que fazer é basicamente re-aprender a usar o Vento.js, e mais importante, vou ter que me lembrar de como navego nessa code-base.</p>\n<p>Vou nessa!</p>\n","date_published":"Tue, 06 May 2025 00:00:00 GMT"},{"id":"http://localhost:3000/articles/estou-usando-o-xubuntu-agora.../","url":"http://localhost:3000/articles/estou-usando-o-xubuntu-agora.../","title":"Estou usando o Xubuntu agora...","content_html":"<p>Esse não é o tipo de assunto que eu costumo fazer um post sobre, mas acho que\nvale a penar comentar um pouco.</p>\n<p>Bom, para começar, a minha distro favorita é a Alpine. Ela é simples, rápida,\nversátil e também é beeem pequena. Mas tem umas coisas que são um pouco chatas\nnela, pelo menos por enquanto. Coisas como:</p>\n<p>pacotes não disponíveis para ela, a musl tendo uma atualização que quebra a\ncompatibilidade com alguns programas, certas coisas precisarem de muito mais\nconfigurações do que outras distros e etc. Além disso, eu\nestou usando o 1Password, e ele simplesmente não abre mais no Alpine. Porque o\nMusl removeu certas funções &quot;antiquadas&quot; em favor de outras mais seguras, o que\nquebrou a compatibilidade de um monte de coisa de uma vez só.</p>\n<p>Não acho que vá demorar muito até isso ser corrigido, mas, por enquanto pelo\nmenos, eu não vou usar o Alpine. No lugar eu usarei o Xubuntu.</p>\n<h1>Mais leve que o padrão e pode ficar ainda mais enxuto.</h1>\n<p>O instalador mais novo da Canonical te permite fazer uma instalação &quot;mínima&quot;, o\nque no caso do Xubuntu, que já é mais leve que o Ubuntu padrão, faz dele algo\nquase que equivalente ao Alpine, depois de executar o script:</p>\n<pre><code class=\"language-sh\">$ setup-desktop xfce\n</code></pre>\n<p>O que faz do Xubuntu, em termos de usabilidade e\npraticidade, superior ao Alpine para mim. Até mesmo com a minha configuração (o\nmeu rice, como seria chamado na comunidade linux) com o Sway, ele se comporta\nde forma que o Alpine, porém mais... estável.</p>\n<p>E sim, eu estou usando o meu setup nesse exato momento, aqui, uma screenshot:</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/8WFk.png\" alt=\"\"></p>\n<blockquote>\n<p>Uma coisa sobre essa screenshot:</p>\n<p>O código que está sendo mostrado é um post sendo escrito usando a linguagem\nde programação <a href=\"https://harelang.org/\">Hare</a>. Eu fiz uma\n<a href=\"https://github.com/ventriloquo/ventriloquo.github.io/tree/3a88160a8303c03924acfbb2eaa4d07d7c7eeac2\">versão</a>\ninteira do meu blog usando ela, mas, como já dá para perceber, não estou\nusando ela no momento.</p>\n</blockquote>\n<h1>Enfim</h1>\n<p>Eu nem sei muito bem o porquê de eu estar escrevendo esse post, eu não estou\nfalando nada de relevante aqui. Mas, de qualquer forma, acho que isso faz bem\npara mim.</p>\n<p>Até o próximo post!</p>\n","date_published":"Wed, 30 Apr 2025 00:00:00 GMT"},{"id":"http://localhost:3000/articles/me-tornei-um-apoiador-do-neocities/","url":"http://localhost:3000/articles/me-tornei-um-apoiador-do-neocities/","title":"Me tornei um apoiador do Neocities","content_html":"<p>É oficial, eu me tornei um apoiador do Neocities. O valor é algo que não me\natrapalha, $5 mensais, o que vale +/- R$30 depois de pagar as taxas de câmbio.\nEm comparação com outras opções de hostings, como por exemplo a opção do meu\npróprio <code>registrar</code>, a Hostinger, que é uns R$20 reais... em um plano de 2\nanos... que você tem que pagar tudo.</p>\n<p>Pois é, em relação a custo, isso aqui é bem mais em conta. E sim, eu sei que o\nGithub Pages faz algo semelhante só que de graça, mas não é a mesma coisa. No\nGithub, o site não é lá tanto algo pessoal quanto ele é um projeto que a\npessoas vão olhar e fazer comparações com outros projetos. No Neocities, a\nideia em si é a criação de sites pessoais, sites simples, sites que lembram a\nestética dos anos 90 e 2000, que lembram a internet na época que ela ainda\nestava engatinhando.</p>\n<p>A conveniência também é um fator muito presente no Neocities. Ele te dá acesso\na uma <code>dashboard</code> em que você pode gerenciar todos os arquivos do site e também\nte da acesso a um editor de código com capacidade de <code>code completion</code>.\nBasicamente um editor de código com um LSP. E que é muito rápido inclusive.</p>\n<p>Outra coisa que é rápida é a velocidade que o site atualiza, você aperta o\nbotão para salvar e o site já está no ar, com todas as mudanças salvas, sem\nnecessidade de reiniciar o Workflow e esperar todo o processo ser concluído.</p>\n","date_published":"Sat, 19 Apr 2025 00:00:00 GMT"},{"id":"http://localhost:3000/articles/o-meu-nintendo-switch-lite/","url":"http://localhost:3000/articles/o-meu-nintendo-switch-lite/","title":"O meu Nintendo Switch Lite","content_html":"<p>Pois é, um Nintendo Switch Lite.</p>\n<p>Se eu tivesse um consultor financeiro, ele iria me dar um chute nas bolas mais\nforte do que uma batida de um Uno com um Gol G2.</p>\n<p>Em questão monetária, esse é o console mais barato que a Nintendo tem a\noferecer. O que faz parecer que ele é uma versão mais fraquinha que o modelo\npadrão, mas isso está longe de ser verdade.</p>\n<p>Se tratando dos componentes internos, o Switch Lite é idêntico ao modelo padrão\nde primeira geração (o v1), já que a versão atualizada do modelo padrão só\nlançou depois do Switch Lite.</p>\n<p>O exterior é onde a coisa muda... e muito.</p>\n<h1>Apenas um portátil</h1>\n<p>A Nintendo optou por fazer o Switch Lite ser apenas um portátil. Algo como o\n<a href=\"https://en.wikipedia.org/wiki/Nintendo_3DS\">3DS</a> era para o\n<a href=\"https://en.wikipedia.org/wiki/Wii_U\">Wii U</a>... se o 3DS tivesse a mesma\npotência do Wii U.</p>\n<p>Eu sei, é uma comparação muito ruim, já que técnicamente os dois consoles da\nvez são basicamente os mesmos em carcaças diferentes. Mas ainda assim eu\nprecisava comparar eles com alguma coisa para poder alongar esse post.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/pepe.webp\" alt=\"._.\"></p>\n<p>Enfim.</p>\n<p>Com os cortes de custo na carcaça, a redução de tamanho (incluindo o tamanho da\ntela), e claro, a remoção dos\n<a href=\"https://en.wikipedia.org/wiki/Joy-Con\">Joy-Cons</a>, o Switch Lite se tornou um\nportátil <em>&quot;barato&quot;</em>. Porém, ainda sendo bem equipado... para um portátil.</p>\n<h1>Tá... e aí?</h1>\n<p>Bom, juntando todos os fatores citados acima, você tem um aparelho do tamanho\nde um celular mediano com controles embutidos que consegue jogar Doom Eternal.</p>\n<blockquote>\n<p>Eu não tô de sacanagem. <strong>TEM</strong> um port de Doom Eternal <strong>OFICIAL</strong> nessa\nporra.\n<img src=\"http://localhost:3000/assets/media/posts/doom_enternal_switch.png\" alt=\"\"></p>\n</blockquote>\n<p>Não que eu tenha jogado Doom Eternal, afinal de contas essa desgraça custa\nR$300. Na realidade a maioria dos jogos hoje em dia tão custando isso, então\nnão tem muito para onde correr (tem sim: Steam).</p>\n<p>Junto da alteração no design do meu site, eu adicionei uma página onde eu\nmostro os jogos que eu tenho atualmente. Não são muitos (pobre é uma coisa\ntriste), mas são jogos que eu me divirto e muito jogando.</p>\n<p>Ah, é mesmo, eu não comentei sobre o design do site!</p>\n<p>Eu fiz a melhor recriação que consegui do aplicativo de &quot;notícias&quot; do Switch.</p>\n<p>Por que? Porque ele é extremamente simples e minimalista (como todo o sistema\nna realidade), sendo assim, relativamente fácil de replicar.</p>\n<p>Mas parte dessa facilidade eu devo ao fato de estar utilizando um SSG. Por que\nnunca que eu iria fazer toda essa alteração de design na mão... de novo.</p>\n<h1>O sistema do Switch é muito divertido</h1>\n<p>Absolutamente <strong>TUDO</strong> tem um efeito sonoro fofo. Eu esperava um toque disso da\nNintendo, mas não <strong>NESSE</strong> nível.</p>\n<p>Navegar pelo sistema é algo simples, intuitivo e, como já disse, divertido.</p>\n<p>Exceto na eShop, aquilo é um sacrilégio de tão sofrível. É impressionante que\nno mesmo console que eu jogo Burnout Paradise a 60fps eu não consigo navegar na\nloja por mais de 5 minutos sem ele pedir por mizericórdia.</p>\n<p>A esse ponto, eu simplesmente compro os meus jogos pela loja web, e só deixo\npara usar a do Switch para achar algum diamante no oceano de promoções de jogos\nmobile super-faturados.</p>\n<blockquote>\n<p>Na real qualquer coisa lá é super-faturada. A porra de um calendário tá\ncustando R$80,00. <strong>UM CALENDÁRIO, CACETE</strong>.\n<img src=\"http://localhost:3000/assets/media/posts/nday.png\" alt=\"\">\nOnde que eu vou precisar de um <strong>CALENDÁRIO</strong> em um <strong>VIDEO-GAME</strong>???</p>\n</blockquote>\n<h1>A pesar dos pesares, eu estou amando a experiência</h1>\n<p>Poder jogar Resident Evil 4 (não é o remake) ou Devil May Cry 3 onde eu quiser\ne a 60fps é simplesmente incrível.</p>\n<p>Eu espero conseguir comprar mais jogos que eram parte da minha infância ou\nsonhos de consumo, como o Resident Evil 4 e o Burnout Paradise.</p>\n<p>Revisitar esses jogos (ou até mesmo experência-los pela primeira vez) é um\nsentimento que eu não consigo descrever em palavras.</p>\n<p>Ok, paguei caro para ter acesso a isso, mas pelo menos eu não comprei um PS5 ou\nSeries X/S e fiquei só com 1 jogo ou nenhum.</p>\n<h1><em>Fin</em></h1>\n<p>Bom, é isso o que eu tenho para falar hoje, a vida de CLT me chama.</p>\n<p>Até o próximo post!</p>\n","date_published":"Wed, 19 Feb 2025 00:00:00 GMT"},{"id":"http://localhost:3000/articles/comprei-um-iphone/","url":"http://localhost:3000/articles/comprei-um-iphone/","title":"Comprei um iPhone","content_html":"<p><img src=\"http://localhost:3000/assets/media/posts/eah.jpg\" alt=\"\"></p>\n<p>Devo admitir que essa compra foi em grande parte algo que fiz puramente\nno emocional, pois depois de alguns meses trabalhando eu finalmente\nconseguir ter condições para comprar um celular flag-ship. Por mais que\nno caso ele seja um flag-ship antigo, ele ainda é um puta de um celular.</p>\n<p>O iPhone em questão é o iPhone 12.</p>\n<p>Pois é, um celular de 4 anos de idade.</p>\n<p>Mas, apesar da &quot;<em>idade avançada</em>&quot;, ele continua sendo um puta celular\nparrudo. Não é porque ele tem 4 anos, que a construção dele é inferior à\nde celulares atuais. Nem por isso a câmera dele ficou defasada. Muito\npelo contrário.</p>\n<p>Em comparação com o celular que eu estava utilizando (Um Moto G52), este\niPhone de 4 anos de idade simplesmente <strong>destrói</strong> ele em <strong>tudo</strong>, com\na única excessão sendo privacidade, pois o meu antigo Moto G52 está com\na LineageOS instalada.</p>\n<p>Este é literalmente o único ponto negativo deste celular, que inclusive\neu comprei pelo mesmo valor que o meu antigo POCO M4 Pro, e também na\nmesma loja de celular. Ou seja:</p>\n<p><img src=\"https://static.displate.com/857x1200/displate/2022-12-08/941aad7a4e6139fe00aa5cd1fbc84aa7_6954feb865b5916c28c8f66026a0d6ce.jpg\" alt=\"\"></p>\n","date_published":"Sun, 15 Dec 2024 00:00:00 GMT"},{"id":"http://localhost:3000/articles/o-vale-da-estranheza/","url":"http://localhost:3000/articles/o-vale-da-estranheza/","title":"O vale da estranheza","content_html":"<p>Esse é um assunto que volta e meia me vem à cabeça. Mas, por qual razão? Bem, os motivos são vários na realidade. Seja no meu consumo de mídia, pela minha navegação na internet ou então até mesmo na vida real, o tal chamado &quot;Vale da estranheza&quot; sempre se mostra uma hora ou outra.</p>\n<p>O curioso disso é como ele é retradado em várias formas de entretenimento. Filmes, séries, animes, jogos, todos eles têm um aspecto principal idêntico na maioria das vezes: O terror.</p>\n<h1>Eu não sou um cara que curte terror</h1>\n<p>não, nada disso, muito pelo contrário, eu sou do tipo que prefere assitir uma comédia romântica à ter que assitir um filme de terror. Mas, esse sub-gênero (e outros como ele) me atrai. Isso é algo difícil de explicar, porém tenho certeza que não sou o único a pensar assim: Apesar de dar calafrios, eu tenho uma curiosidade que aumenta cada vez mais.</p>\n<p>A minha primeira exposição ao vale da estranheza foi, provavelmente como muitas outras pessoas, com o meme do senhor incrível.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/sr_incrivel.png\" alt=\"Image\"></p>\n<p>É óbvio que esse meme não é a melhor representação do Vale da estranheza, mas ele já é uma boa demonstração do que ele pode ser. O sentimento que imagens do Vale da estranheza proporcionam é o de… desconforto. Pelo menos no meu caso esse é o sentimento. Algo que está errado, de alguma forma, e você consegue perceber, porém, ele também te lembra algo que não lhe é estranho, mundano, comum. Esse conflito gera esse desconforto esquisito.</p>\n<p>Esse meme ficou popular, e por consequência eu consumi muitos vídeos no youtube contendo esse meme, fazendo assim com que o algorítimo me recomendasse vídeos contendo temas relacionados e afins. Então, eu foi exposto à um outro gênero similar ao Vale: Os espaços liminares. Depois eu comento mais sobre eles.</p>\n<p>Apesar disso, eu, por algum motivo que só Deus sabe, tenho um interesse nesse estilo de terror, e em outros estilos similares/derivados dele.</p>\n<p>Isso me torna alguém que gosta de terror mas só não quer admitir? Provavelmente. Mas estamos na internet e são poucos os que querem ser coerentes por aqui.</p>\n<h1>A presença do Vale da estranheza na mídia que consumo</h1>\n<h2>Jogos</h2>\n<p>Uns meses atrás, eu comecei a jogar <a href=\"https://en.wikipedia.org/wiki/Silent_Hill_(video_game)\">Silent Hill</a>, um clássico do Playstation 1. O jogo constantemente te dá calafrios por toda a gameplay. É um ótimo exemplo do que é possível fazer mesmo tendo diversas limitações. No caso, um exemplo de como fazer alguém infartar.</p>\n<p>Devido às limitações da época, existe uma presença fortíssima de compressão de alguns assets, como por exemplo, as texturas e os efeitos sonoros. No caso das texturas, em alguns momentos é difícil até mesmo dizer se o que tá na sua frente é uma mancha de sujeira, uma queimadura ou então até mesmo sangue ressecado. Literalmente o seu cérebo é quem vai decidir da hora.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/silent_hill_screenshot_03.jpg\" alt=\"Image\"></p>\n<p>Outra coisa boa a se comentar é a visão extremamente limitada. Isso é uma limitação do próprio hardware do Playstation, mas a equipe que fez Silent Hill contornou isso e transformou em parte da gameplay. E olha, se tem uma coisa que me assusta, é não saber se o que tá na minha frente é um ser humano, ou outra coisa que provavelmente não tá afim de conversar.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/SH1_rifle.jpg\" alt=\"Image\"></p>\n<p>Infelizmente eu perdi o meu save do jogo, eu estava na seção do parque de diversões, por conta da frustração de ter perdido o save e também por preguiça de ter que jogar tudo de novo, eu acabei não jogando mais. Porém, esse jogo tem o meu respeito. Ele tem pouquíssimos jumpscares, a maior parte da gameplay ele simplesmente ataca a sua ansiedade e te deixa apreensivo, mas ainda assim ele sabe dosar, e muito bem, quando ele deve fazer o seu coração bater um tanto mais rápido.</p>\n<h2>Animes</h2>\n<p>Mais recentemente foi lançado na Netflix a adaptação do mangá <a href=\"https://en.wikipedia.org/wiki/Dandadan\">Dandadan</a>, mas eu não o conheci por trailers ou por que me foi recomendado na home da Netflix. Eu fui apresentado à esse mangá por meio de um youtuber que acompanho, o <a href=\"https://www.youtube.com/@CentralNaythf\">Naythf</a>.</p>\n<p><a href=\"https://youtu.be/eUQiwNVp6MU?si=M4N2eF5DmrYD7ZFp\">No vídeo que ele comenta sobre Dandadan</a>, o Naythf fala sobre vários aspectos do mangá, como por exemplo os temas abordados e gêneros da obra. O curioso para mim foi a parte de terror do mangá. No maior estilo <a href=\"https://en.wikipedia.org/wiki/Junji_Ito\">Junji Ito</a>, as partes de terror focam (e muito) na estranheza. Não sei dizer se chega a poder ser considerado algo do Vale, mas no mínimo chega perto.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/dandadan-manga-primo-capitolo-05.jpg\" alt=\"Image\"></p>\n<p>Uma outra aparição de algo que me lembra o vale da estranheza foi no anime <a href=\"https://en.wikipedia.org/wiki/Chainsaw_Man\">Chainsaw Man</a>, no caso em uma de suas finalizações de episódio. Para ser mais exato, na <a href=\"https://www.youtube.com/watch?v=ymQ3wEIq84Y\">5ª finalização</a>.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/chainsaw-man-ending-5.webp\" alt=\"Image\"></p>\n<p>Sei que a intenção não era exatamente o Vale, mas ainda assim não consigo assistir essa finalização sem fazer essa comparação.</p>\n<p>Todo o cenário e a ambientação em que os personagens estão me lembram também os Espaços Liminares. Não seria uma surpresa para mim se essa semelhança fosse intencional, afinal, tanto o anime quanto os Espaços Liminares ficaram em alta +/- na mesma época.</p>\n<h1>Espaços liminares</h1>\n<p>Os espaços liminares tomam um rumo semelhante ao Vale, porém ele se diverge em um ponto: Na ambientação.</p>\n<p>A ambientação dos espaços liminares é bem característica, são lugares que você espera que vá ter algo ou alguém por lá, mas, não há nada. Somente o que foi deixado por lá.</p>\n<p>Sinceramente esse gênero de terror é o que mais me dá medo, por quê diferente de um alien vestido de ser humano e um cachorro assassino sem pele, um espaço liminar é perfeitamente possível na vida real. Na realidade eles não são possíveis, eles existem.</p>\n<p>Essa é a parte que mais pega nos meus nervos. O fato de você não só ver ou achar, mas até mesmo de você ter alguma lembrança com o local. Como por exemplo, um parque aquático abandonado. Apesar de nunca ter ido a um pessoalmente, até mesmo eu fico com calafrios em ver algo como isso:</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/liminal.webp\" alt=\"Image\"></p>\n<p>Não tem nada de errado com o local em si, nem com a imagem, porém, ainda assim, algo parece estar errado.</p>\n<p>Uma explicação dada por muitas pessoas na internet é a de que o motivo desse desconforto vêm do fato de você esperar vem alguém na foto, por ser um local público e por você sempre ver um local como esse, populado.</p>\n<p>A verdade é que cada pessoa tem uma reação à espaços como esses, no meu caso eu sinto calafrios, quase como se tivesse algo a mais na foto, mas que eu não estou enxergando, para outras pessoas, é só uma foto de um lugar vazio.</p>\n<p>Mas sem sombra de dúvidas, uma das modas da internet relacionada a esse tema que mais me intrigou foram as <a href=\"https://en.wikipedia.org/wiki/The_Backrooms\">Backrooms</a>.</p>\n<h2>The Backrooms</h2>\n<p><img src=\"http://localhost:3000/assets/media/posts/HobbyTown_USA_Oshkosh_interior_under_construction_2002_(The_Backrooms).jpg\" alt=\"Image\"></p>\n<p>Tudo começou com um post na aba paranormal do 4chan, a mensagem do usuário em si não tinha nada de mais, porém a resposta é uma coisa completamente a parte.</p>\n<blockquote>\n<p>If you're not careful and you noclip out of reality in the wrong areas, you'll end up in the Backrooms, where it's nothing but the stink of old moist carpet, the madness of mono-yellow, the endless background noise of fluorescent lights at maximum hum-buzz, and approximately six hundred million square miles of randomly segmented empty rooms to be trapped in<br><br>\nGod save you if you hear something wandering around nearby, because it sure as hell has heard you</p>\n</blockquote>\n<p>E é com essa resposta que nasce um fenômeno na internet, um <a href=\"https://en.wikipedia.org/wiki/Alternate_reality_game\">ARG</a>, e claro, uma fandom.</p>\n<p>O que mais me deixou intrigado foi a semelhança dos ARG's de The Backrooms com a <a href=\"https://en.wikipedia.org/wiki/SCP_Foundation\">SCP Foundation</a>. Cada sala em The Backrooms tem um padrão, um método a seguir para conseguir fugir, e claro, algum tipo de anomalia presente. Seja ela uma criatura humanoide ou até mesmo um sorriso flutuante.</p>\n<p>The Backrooms ficou tão popular que ultrapassou o gênero de <a href=\"https://en.wikipedia.org/wiki/Analog_horror\">Analog Horror</a> (o meu gênero favorito de terror). Diversos criadores de conteúdo fizeram vídeos comentando sobre, teorizando, fazendo gameplays de alguns jogos com esse tema.</p>\n<h3><a href=\"https://www.youtube.com/c/KANEpixels\">Kane Pixels</a></h3>\n<p>Esse carinha fez as Backrooms simplesmente explodirem.</p>\n<p>Durante a onda de vídeos sobre as Backrooms, os vídeos dele se destacavam (e muito) entre todos os outros. Seja por qualidade técnica ou por ambientação, os vídeos que ele produzia (e produz até hoje) são de cair o queixo.</p>\n<p>Ele não só conseguiu fazer uma combinação de Analog Horror com The Backrooms, como fez isso beirando a perfeição.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/The-Backrooms-Kane-Pixels-01.jpg\" alt=\"Image\"></p>\n<p>Foi basicamente dos vídeos dele que surgiu a inspiração de diversos jogos que se vê por aí na Steam ou Itch.io.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/smii7y_return_to_the_backrooms.webp\" alt=\"Image\"></p>\n<h1>Analog horror</h1>\n<p>Bem, já que eu mencionei ele, por quê não comentar sobre?</p>\n<p>Assim como The Backrooms, esse gênero ficou extremamente popular uns tempos atrás. Começando uma febre com vídeos do universo de <a href=\"https://en.wikipedia.org/wiki/Five_Nights_at_Freddy%27s\">FNAF</a>, poís é, FNAF. A maior parte desses vídeos giravam em torno de serem fitas de uso interno da empresa - Fitas de treinamento, relatórios gravados, filmagens de segurança - e que não eram feitas para serem consumidas por pessoas não-autorizadas.</p>\n<p>Mas sempre, de alguma forma, alguém conseguia acesso às fitas e colocava as gravações na internet.</p>\n<p>A parte mais interessante de alguns desses vídeos era a parte técnica, muitos deles eram quase que um &quot;olha só o que eu sei fazer&quot;.</p>\n<p>Pois é, esse tema ficou saturado beeeeem rápido. Mas, algumas pessoas viram potêncial nesse estilo de terror, e decidiram criar universos próprios, tendo como uma base o horror analógico.</p>\n<p>Coisas como <a href=\"https://www.youtube.com/@blackdrag0nfish\">Nephthys Media</a>, que exploravam um horror cósmico, começaram a surgir. O que foi um fator que me fez ter interesse nesse gênero.</p>\n<h2>Nephthys Media</h2>\n<p><img src=\"http://localhost:3000/assets/media/posts/hqdefault.jpg\" alt=\"Image\"></p>\n<p>Apesar de não lembrar de praticamente nada do Nephthys Media, uma coisa que não tem como eu me esquecer é a atmosfera presente nele, é algo que me lembra os Espaços Liminares. É um desconforto constante e a impressão de que tem algo a mais que eu não estou enxergando.</p>\n<p>Pode se dizer que esse analog horror em específico é o responsável por eu ter um certo medo de astros.</p>\n<p>O enredo gira em torno de entidades que habitam os astros e em seus planos. Como disse eu não lembro de muita coisa, mas ainda assim é algo que eu recomendo.</p>\n<h2>The Mandela Catalogue</h2>\n<p>Outro que ficou extremamente popular, mas que o criador perdeu a mão.</p>\n<p>Ele explora a bizarrice que são <a href=\"https://en.wikipedia.org/wiki/Doppelg%C3%A4nger\">Doppelgängers</a>, e pelo menos no início da minisérie, consegue fazer isso muito bem até.</p>\n<p>O maior problema do Mandela Catalogue é que o seu criador acabou enjoando da própria obra e quis fazer dela algo &quot;maior&quot;. Vamos dizer que ele voou muito perto do sol e acabou estragando a minisérie, pelo menos para mim, eu já não tenho o mínimo de interesse por ela depois do 2º capítulo.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/catalogue-mondela-mandela-magazine.gif\" alt=\"Image\"></p>\n<center><a href=\"https://www.youtube.com/watch?v=gk4AlxnZOYc\" target=\"_blank\">The Mandela Magazine</a></center>\n<p>Uma coisa que pode ser aprendida com o caso do Mandela Catalogue é a seguinte: Se a sua obra se tornou popular por conta da ambientação e do mistério que gira em torno de algo quase que no estilo Lovecraft de absurdo, não transforma ela em uma minisérie de terror adolescente.</p>\n<h2>The Walden Files</h2>\n<p>Esse me dá arrepios só de lembrar.</p>\n<p>The Walden Files é um ARG que tem inspirações em FNAF e em The Mandela Catalogue. Porém, só somente inspirações, ele é uma obra que não só se destaca como também elevou o padrão do gênero de Analog Horror.</p>\n<p>Ele genuinamente me dá medo. Medo ao ponto de que eu só consumi ele por intermédio de um youtuber, o <a href=\"https://www.youtube.com/@pombatomico\">Pombo Atômico</a> e de dia na maior parte das vezes.</p>\n<p><img src=\"http://localhost:3000/assets/media/posts/walden_files.webp\" alt=\"Image\"></p>\n<p>Ele também é extremamente gráfico e sonoro. Não é algo que eu recomendaria para a minha namorada por exemplo.</p>\n<p>Mas a história que é contada… Olha, faz valer a pena. É com um dedo de FNAF, mas contada de uma forma coesa durante toda a obra e sem entregar fria e sem bandeja. Do início ao fim a sua curiosidade é instigada.</p>\n<p>É uma ótima obra para se ver no Halloween. E talvez uma ótima obra para não assitir enquanto você está comendo alguma coisa.</p>\n<h1><em>Fin</em></h1>\n<p>Bem, isso é tudo o que eu tinha a comentar por agora. O halloween está chegando e eu quis dar os meus 5 centávos aqui.</p>\n<p>Te vejo no próximo post!</p>\n","date_published":"Thu, 31 Oct 2024 00:00:00 GMT"},{"id":"http://localhost:3000/articles/tô-usando-o-proton/","url":"http://localhost:3000/articles/tô-usando-o-proton/","title":"Tô usando o Proton","content_html":"<p>Depois de aproximadamente 1 ano, eu criei uma nova conta no <a href=\"https://proton.me/\">Proton</a>. Um serviço de e-mail/calendário online/VPN/cloud storage/gerenciador de senhas/carteira de bitcoin, enfim, um serviço que foca em prover basicamente as ferramentas que comumemte utilizamos com mais frequência do Google (GMail, Google Calendar, Google Drive, Google Passwords) com aquela pitada de privacidade que só a mão do Shaquille O'Neal consegue fazer.</p>\n<h1>Por que?</h1>\n<p>Nas últimas semanas eu comecei a voltar ao meu antigo estilo de vida sem o Google, o fato de eu ter conseguido um emprego foi um facilitador nesse aspecto. No dia do aniversário do meu irmão, eu troquei de celular com ele, dando o meu Poco M4 Pro para ele e ficando com o Moto G52 dele.</p>\n<p>Essa não foi a primeira vez que a gente fez isso, na verdade na primeira vez que fiz isso com ele foi porque o Moto G52 possui uma ROM oficial da LineageOS disponível, e digamos que quando eu descobri isso eu tive uma <a href=\"https://i.pinimg.com/736x/87/07/97/8707972a759975b07d188308c948cc27.jpg\">ativação neural</a> e no mesmo dia a gente fez essa troca. E claro, eu coloquei a Lineage no G52.</p>\n<p>Enfim, vou cortar um pouco da história e pular para o presente.</p>\n<p>Depois que eu fiquei com o G52 com a Lineage instalada novamente, eu comecei a fazer uma especie de &quot;detox digital&quot;, mas eu não estava deletando contas, eu estava desvinculando o Google delas. Porém, uma coisa que estava sendo uma pedra no meu caminho era o GMail, e bem, eu tenho e-mails alternativos, mas os servidores deles são lentos o suficiente para que eu basicamente só leia um e-mail 1 hora depois que eu &quot;recebi&quot; ele.</p>\n<p>Tendo isso em mente, eu criei uma nova conta no Proton, que dentre várias coisas, também me dá acesso a 10 e-mail aliases. O que me permite remover o GMail da jogada, e mesmo as coisas que não estão (ainda) usando aliases não ficam presas no limbo, já que o Proton me permite receber os e-mails do GMail, no Proton, ou seja, eu não preciso nem mesmo abrir o GMail para ler os e-mails que chegam por lá.</p>\n<h1>Mudanças no armazenamento</h1>\n<p>Ano passado, quando eu tinha uma conta no Proton, o armazenamento era bem limitado, somente 1Gb (depois de fazer uma configuração na conta, o padrão era 512Mb) era disponível. Esses 1Gb eram compartilhado entre o serviço de e-mail/calendário e o de cloud storage. Não sei se já ficou claro, mas 1Gb não é lá muita coisa para um serviço de cloud storage, muito menos quando isso é compartilhado com outros serviços.</p>\n<p>Mas, com a nova conta que criei ainda hoje, eu reparei que no serviço de e-mail o armazenamento continua sendo de 1Gb, porém o serviço de cloud storage se inicia com 3Gb! Podendo ser aumentado para 5Gb depois de seguir um passo a passo de configuração!</p>\n<p>Isso é algo que eu simplesmente não tava esperando, mas é uma mudança mais que bem vinda, porque eu posso mover os arquivos que eu tinha no Google Drive para cá com muito mais folga.</p>\n<h1>Uma senha praticamente impossível de digitar para a conta do Google</h1>\n<p>Eu também estou dificultando ao máximo o meu login do Google, praticamente tornando impossível que eu faça login sem utilizar o KeePass, o que por sua vez, faz com que eu deixe de utilizar um sistema que não seja uma distro linux, no caso do meu pc, ou a LinageOS, no meu celular.</p>\n<p>O KeePassXC havia lançado a +/- 2 meses atrás uma função que te permite criar passkeys utilizando o próprio KeePassXC, o que elimina a necessidade de um celular com a Google impregnada ou um iPhone. Óbviamente eu já passei a limpa em todas as contas que eu usava uma passkey da Google e gerei novas usando o KeePassXC.</p>\n<p>Tudo isso me deixa cada vez menos dependente do Google, o que é algo que sinceramente qualquer pessoa deveria tentar fazer. Não só com o Google, mas com basicamente qualquer uma dessas empresas que até um idoso de 90 anos reconhece de tão popular.</p>\n<h1><em>Fin</em></h1>\n<p>Enfim, acho que já tagarelei demais.\nAté o próximo post!</p>\n","date_published":"Sun, 25 Aug 2024 00:00:00 GMT"},{"id":"http://localhost:3000/articles/lume-o-novo-ssg-que-estou-utilizando/","url":"http://localhost:3000/articles/lume-o-novo-ssg-que-estou-utilizando/","title":"Lume - O novo SSG que estou utilizando","content_html":"<p>Pois é, depois de algum tempo batendo a cabeça na parede para tentar ter alguma ideia do que fazer de novo no site, me veio a ideia de migrar para o <a href=\"https://lume.land/\">Lume</a>.</p>\n<p>Claro que eu fui primeiro verificar se essa migração seria viável, visto que o Hugo, por exemplo, foi uma ideia que rapidamente se provou como sendo uma idéia não só péssima, como estressante.</p>\n<p>Então, eu fui pesquisar a respeito do Lume antes de tentar fazer alguma coisa, e percebi que não só o processo de migração seria extremamente fácil, como também eu teria vantagens que eu não tinha com o Jekyll (além do build step ser bem mais rápido).</p>\n<h1>Javascript</h1>\n<p>Não é segredo para ninguém que eu não sou o maior fã do Javascript, e sempre procuro utilizar o mínimo possível, porém, hoje em dia eu o enxergo como uma ferramenta qualquer que, se usada de forma correta, pode facilitar e muito a minha vida.</p>\n<p>Um exemplo disso é o próprio Lume, que é um <a href=\"https://en.wikipedia.org/wiki/Static_site_generator\"><code>Static Site Generator</code></a> para o <a href=\"https://deno.land/\">Deno</a>, um runtime de Javascript.</p>\n<p>O uso de Javascript no Lume, junto de sua arquitetura, permitem que ele seja um SSG extremamente customizável e versátil, e ainda assim, por utilizar o Deno, ser rápido.</p>\n<h1>LumeCMS</h1>\n<p>Isso é algo que eu nunca pensei que seria tão simples de configurar. Mas o LumeCMS é.</p>\n<p>Para quem não sabe, um <a href=\"https://pt.wikipedia.org/wiki/Sistema_de_gerenciamento_de_conte%C3%BAdo\">CMS</a> é</p>\n<blockquote>\n<p>um programa de computador utilizado para criar, editar, publicar e gerenciar conteúdos em plataformas digitais e páginas online pré-estruturadas</p>\n</blockquote>\n<p>O que significa tudo isso? Basicamente que eu tenho uma interface que facilita a criação de posts ou tutoriais nesse site, dentre outras coisas que eu posso configurar também.</p>\n<p>A customização desse CMS também me impressionou e muito, mas não tanto quanto o processo de utilizar ele. Se fosse para definir em uma palavra, eu o definiria como &quot;eficiênte&quot;.</p>\n<p>Não tem um processo longo de instalação nem configuração, o CMS vai fazer parte da codebase do site usando o Lume e a documentação do CMS é tão simples que mesmo eu, que não sou um fanático por Javascript e Webdev, conseguiu configurar o CMS a um ponto agradável em questão de 1 hora.</p>\n<h1>Coisas que mudaram no site</h1>\n<p>Como já mencionei, a transição foi algo simples e direto ao ponto, mas não significa que eu consegui transportar tudo do Jekyll para cá.</p>\n<p>Um exemplo de algo que não consegui trazer para aqui foi o Rogue, que era o responsável por geral blocos de código com syntax-highlighting utilizando somente HTML e CSS. O mesmo vale para o gerador de <code>TOC</code> (Tabela de Conteúdos).</p>\n<p>Como resultado, eu voltei a utilizar o Prism.js, e até o momento, ainda não implementei um <code>TOC</code>.</p>\n<p>O site no geral teve uma polida por debaixo dos panos, mas nada que fosse extremo a ponto de fazer alguma diferença notável.</p>\n<h1><em>Fin</em></h1>\n<p>Bem, é isso. Espero que você tenha gostado deste post.</p>\n<p>Te vejo no próximo post!</p>\n","date_published":"Tue, 20 Aug 2024 00:00:00 GMT"},{"id":"http://localhost:3000/articles/tô-usando-o-jekyll-de-novo/","url":"http://localhost:3000/articles/tô-usando-o-jekyll-de-novo/","title":"Tô usando o Jekyll de novo","content_html":"<p>É isso mesmo que você acabou de ler. Eu tô usando o Jekyll de novo. Cara, eu\ndevo estar inconscientemente treinando para conseguir o recorde mundial de\npessoa mais indecisa, eu simplesmente não consigo entender o porquê de eu fazer\nisso, é algo praticamente impulsivo.</p>\n<h1>Jekyll... de novo.</h1>\n<p>Ok, vamos direto ao o que importa: o Jekyll.</p>\n<p>Sim, eu tinha re-estruturado o site inteiro para que eu só precisasse de um\nscript que eu mesmo tinha criado, como eu mencionei <a href=\"http://localhost:3000/2024/06/25/Simplifiquei-o-site.html\">aqui</a>.</p>\n<p>Para jogar mais sal na ferida, eu tinha dito o seguinte:</p>\n<blockquote>\n<p>Eu queria deixar esse site mais fácil de ser editado (ou até mesmo atualizado) pelo Neocities.</p>\n</blockquote>\n<p>Pois é. Agora eu tô usando o Jekyll de novo.</p>\n<p>Enfim, o resumo da ópera é que eu percebi um pequeno problema com a forma que\neu estava estruturando o site, e meio que... Não daria para manter ele do jeito\nque ele estava por muito tempo. A não ser que eu quisesse que este site fosse\napenas um blog (sem feed rss, eu conseguiria fazer isso modificando o script,\nmas seria mais trabalhoso do que re-implementar o Jekyll, e bom, aqui estamos),\nnesse caso ele estava funcionando perfeitamente bem.</p>\n<h1>0 Javascript, de novo.</h1>\n<p>Uma consequência de voltar a usar o Jekyll é a falta de necessidade de utilizar\no Javascript em diversas partes do site. O meu único uso era para blocos de\ncódigo, e eu utilizava o Prism.js para renderizar esses blocos.</p>\n<p>Mas o Jekyll já vem com algo que faz a mesma coisa que o Prism, e o que for\ngerado vai fazer parte do HTML do site, sem a necessidade do usuário ser quem\nprocessa a sintáxe do bloco de código.</p>\n<p>Eis aqui um exemplo:</p>\n<pre><code class=\"language-rust\">use fmt;\n\nexport fn main() void = {\n    fmt::println(&quot;Olá, mundo!&quot;)!;\n};\n</code></pre>\n<h1>Mas espere aí! Tem uma coisa diferente</h1>\n<p>O que eu fiz de diferente desta vez foi em relação com o shell-script que era\nutilizado para criar novos posts, mesmo antes de eu ter removido o Jekyll do\nsite, era utilizado um shell-script para poder agilizar o processo de criar\nnovos posts.</p>\n<p>O que é que tá diferente nele?</p>\n<p>Simples.</p>\n<p>Ele não é mais um shell-script, ele é um script Ruby!</p>\n<p>A mesma linguagem em que o Jekyll é escrito. Ou seja, eu removi uma dependência\nexterna do processo de construção do site. Não era algo crítico, mas ainda\nassim é algo que eu acho bom de fazer.</p>\n<p>No caso, diminuir a quantidade de peças diferentes envolvidas no projeto.</p>\n<p>O script não é tão diferente do <a href=\"http://localhost:3000/2024/06/25/Simplifiquei-o-site.html\">anterior</a>,\nmas já dá para ver suas particularidades:</p>\n<pre><code class=\"language-ruby\">#!/usr/bin/ruby\nrequire 'date'\n\nputs &quot;Escolha o que você quer fazer:&quot;\nputs &quot;1: Fazer um post&quot;\nputs &quot;2: Fazer um tutorial&quot;\nputs &quot;&quot;\nchoice = gets.chomp\n\nif choice == &quot;1&quot;\n  path = &quot;_posts&quot;\nelsif choice == &quot;2&quot;\n  path = &quot;_tutorial&quot;\nelse\n  abort(&quot;Opção inválida.&quot;)\nend\n\nputs &quot;Título:&quot;\ntitle = gets.chomp\nputs &quot;&quot;\nputs &quot;Descrição:&quot;\ndescription = gets.chomp\nputs &quot;&quot;\nputs &quot;Thumbnail:&quot;\nthumbnail = gets.chomp\ndate = DateTime.now.strftime(&quot;%Y-%m-%d-&quot;)\n\nfilename = date + title + &quot;.md&quot;\nfile = File.new(filename, &quot;w&quot;)\n\nFile.open(file, &quot;w&quot;) do |f|\nf.write(&quot;---\nlayout: post\ndraft: true\nthumbnail: #{thumbnail}\ntitle: #{title}\ndescription: #{description}\n---\n* TOC\n{:toc}\n&quot;)\nend\n\nspawn(&quot;mkdir -p #{path}&quot;)\nspawn(&quot;mv #{filename} #{path}&quot;)\nexec(&quot;nvim&quot;, &quot;#{path}/#{filename}&quot;)\n</code></pre>\n<p>Tudo o que vou comentar sobre este bloco é isso aqui:</p>\n<blockquote>\n<p>Eu sei que esse código não é o mais eficiênte, mas o importante é que ele funciona.</p>\n</blockquote>\n<h1><em>Fin</em></h1>\n<p>Bom, isso é basicamente tudo o que eu tenho para dizer por hoje, amanhã tenho\nque ir trabalhar (vida de CLT é complicada, mas vale a pena).</p>\n<p>Até o próximo post!</p>\n","date_published":"Mon, 29 Jul 2024 00:00:00 GMT"},{"id":"http://localhost:3000/articles/emacs!/","url":"http://localhost:3000/articles/emacs!/","title":"Emacs!","content_html":"<p>A mais ou menos 3 dias, me surgiu uma vontade de voltar a usar o\nEmacs. Não sei muito bem o porquê, mas o que posso dizer é que desde\nentão comecei a configurar ele.</p>\n<p>Diferente da última vez que eu configurei o Emacs, eu quis fazer\ncom que essa configuração seja basicamente um substituto a\n<a href=\"https://github.com/tukainpng/nvim\">minha configuração do Neovim</a>,\no que significa que eu vou precisar instalar alguns pacotes.</p>\n<h1>Preciso de alguns, não de muitos</h1>\n<p>Uma característica do Emacs é que ele tem praticamente tudo o que você\nprecisa pré-instalado, então muitas das coisas que eu tenho na minha\nconfiguração do Neovim pode ser replicada com uma simples linha de Elisp.</p>\n<p>Na verdade, muitas das coisas que a minha configuração do Neovim tem\nforam adicionadas para imitar a minha antiga configuração do Emacs, como por\nexemplo o Which-key.</p>\n<h1>Além de substituto do Neovim, um substituto do meu sistema inteiro...</h1>\n<p>A minha segunda intenção com o Emacs é deixar ele num ponto onde eu não\nprecise sair dele, a menos que seja absolutamente necessário.</p>\n<p>O que não é muito difícil, visto que já fiz isso no passado, então\né só uma questão de tempo até eu conseguir replicar o meu antigo setup.</p>\n<p>Por enquanto, o que eu tenho em mente para adicionar agora é o org-present\n(pacote para fazer slides em arquivos .org) e o bongo (um pacote que\né um player de música).</p>\n<h1>Um ambiente de trabalho integrado e confortável</h1>\n<p>Uma das coisas que mais me deixou com saudades do Emacs foi o quão integrado\ntudo pode ser.</p>\n<p>Tudo o que você precisa, dentro de 1 programa, com apenas 1 key-choord de\ndistância.</p>\n<p>Uma das coisas que eu fazia na época em que o meu site era feito usando org-mode\n(sim, isso aconteceu) era editar um post, e apertar uma tecla de atalho que eu tinha\npara exportar e abrir o navegador na página que eu estava editando.</p>\n<p>A sentimento que isso dava era o de estar em um ecossistema de desenvolvimento, era\nsimplesmente incrível.</p>\n<p>E é óbvio que eu quero restaurar aquele &quot;ecossistema&quot; que eu tinha, e na verdade já\nestou relativamente perto de conseguir. Só mais alguns ajustes e pronto!</p>\n<h1><em>Fin</em></h1>\n<p>Bem, hoje eu quis fazer um post bem rapidinho, então não vou me extender demais aqui.\nAté o próximo post!</p>\n","date_published":"Sun, 21 Jul 2024 00:00:00 GMT"}]}